# Написать программу преобразования десятичного числа в двоичное
n = int(input("Напишите число: "))
print(format((n), 'b'))