# Найти НОК(наименьшее общее кратное) двух чисел

a = int(input("Введите число: "))
b = int(input("Введите число: "))
print((a + b) / 2)