# Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

a = input("Введите строку: ")
my_list1 = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
# my_list1 = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
# my_list1 = ["йцу", "фыв", "ячс", "цук", "йцукен"]
# my_list1 = ["123", "234", 123, "567"]
# my_list1 = []
all_indexes = []
i = 0
try:
    while i < len(my_list1):
        if a == my_list1[i]:
            all_indexes.append(i)
        i += 1
    print(all_indexes[1])
except IndexError:
    print("-1")