# Реализовать алгоритм перемешивания списка.

from random import shuffle
my_list = list(range(1, 20, 2))
shuffle(my_list)
print(my_list)