# Реализовать алгоритм задания случайных чисел.
# Без использования встроенного генератора псевдослучайных чисел

s = {1, 2, 3, 4, 5, 6, 7, 8, 9, 0}
for i in s:
    print(i)